img/app/controllers/images_controller.rb

SELECT "images".* FROM "images"
---
  def public
    @images = Image.all

SELECT "images".* FROM "images"
SELECT "users".* FROM "users"
---
  def home
    @images = Image.all
    @users = User.all

SELECT "tags".* FROM "tags"
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "image_users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-11-16 02:15:52.244150"], ["updated_at", "2015-11-16 02:15:52.244150"]]
---
  def show
    @tags = Tag.all
    @image_user = ImageUser.new
    @image_user.image_id = Image.find params[:id]
    @image_user.user_id = :user_id
    @image_user.save

INSERT INTO "images" ("private", "filename", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["private", "f"], ["filename", "BETMNQVM.jpg"], ["user_id", 27], ["created_at", "2015-11-17 03:48:09.404736"], ["updated_at", "2015-11-17 03:48:09.404736"]]
---
  def create
    @image = Image.new(image_params)

    @image.filename = (0...8).map { (65 + rand(26)).chr }.join + ".jpg"
    @image.user = current_user

    @uploaded_io = params[:image][:uploaded_file]

    File.open(Rails.root.join('public', 'images', @image.filename), 'wb') do |file|
      file.write(@uploaded_io.read)
    end

    if @image.save

UPDATE "images" SET "private" = ?, "updated_at" = ? WHERE "images"."id" = ?  [["private", "t"], ["updated_at", "2015-11-16 02:21:48.302301"], ["id", 208]]
---
  def update
    respond_to do |format|
      if @image.update(image_params)