img/app/controllers/image_users_controller.rb

  def share
    @image_users = ImageUser.all
    @images = Image.all
---
SELECT "image_users".* FROM "image_users"
SELECT "users".* FROM "users"
SELECT "images".* FROM "images"

  def index
    @image = Image.find params[:image_id]
    @image_users = ImageUser.all
---
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", 7]]
SELECT "image_users".* FROM "image_users"
SELECT "users".* FROM "users"

  def show
    @image_user = ImageUser.find params[:id]
    @images = Image.all
---
SELECT  "image_users".* FROM "image_users" WHERE "image_users"."id" = ? LIMIT 1  [["id", 446]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "images".* FROM "images"

  def new
    @image = Image.find params[:image_id]
---
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", 7]]

  def create

    @image = Image.find params[:image_id]
    @image_user = @image.image_users.new(image_user_params)
    if @image_user.save
---
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", 7]]
INSERT INTO "image_users" ("user_id", "image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["image_id", 7], ["created_at", "2015-11-16 02:16:01.102923"], ["updated_at", "2015-11-16 02:16:01.102923"]]

  def destroy
    @image_user.destroy
---
DELETE FROM "image_users" WHERE "image_users"."id" = ?  [["id", 446]]

    def set_image_user
      @image_user = ImageUser.find(params[:id])
---
SELECT  "image_users".* FROM "image_users" WHERE "image_users"."id" = ? LIMIT 1  [["id", 446]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]