img/app/controllers/tags_controller.rb

  def index
    @image = Image.find params[:image_id]
    @tags = Tag.all
---
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", 7]]
SELECT "tags".* FROM "tags"

  def new
    @image = Image.find params[:image_id]
    @tag = Tag.new
    @tag.image_id = @image.id
    @tag.save
---
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", 7]]
INSERT INTO "tags" ("image_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["image_id", 7], ["created_at", "2015-11-16 02:58:52.024939"], ["updated_at", "2015-11-16 02:58:52.024939"]]

  def edit
    @tag = Tag.find params[:tag_id]
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 191]]

  def update

    respond_to do |format|
      if @tag.update(tag_params)
---
UPDATE "tags" SET "str" = ?, "updated_at" = ? WHERE "tags"."id" = ?  [["str", "Yes"], ["updated_at", "2015-11-16 02:58:55.893993"], ["id", 507]]