img/app/views/image_users/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= f.label :user_id %>
    <%= f.collection_select :user_id, User.all, :id, :name, :selected => @image_user.user_id %>